app/controllers/api/drawings_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "drawings".* FROM "drawings" WHERE "drawings"."user_id" = $1  [["user_id", 2]]
---
  def index
    @drawings = User.find(params[:user_id]).drawings

INSERT INTO "drawings" ("file_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["file_url", "https://www.filepicker.io/api/file/J0ZdzAaqSBWjB7uUDLGQ"], ["user_id", 2], ["created_at", "2015-02-03 21:45:27.672484"], ["updated_at", "2015-02-03 21:45:27.672484"]]
---
  def create
    @drawing = current_user.drawings.new(drawing_params)
    if @drawing.save