app/controllers/api/porfolios_controller.rb

INSERT INTO "porfolios" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["description", "tesing "], ["user_id", 2], ["created_at", "2015-02-04 01:26:12.604255"], ["updated_at", "2015-02-04 01:26:12.604255"]]
---
  def create
    @porfolio = current_user.porfolios.new(porfolio_params)
    if @porfolio.save